package SWResource_imas;

#----------------------------------------
# 人狼物語キャラセット
#----------------------------------------

sub GetRSChr {
    my $sow = $_[0];

    my $maker = $sow->{'cfg'}->{'CID_MAKER'};
    my $admin = $sow->{'cfg'}->{'CID_ADMIN'};
    my $guest = $sow->{'cfg'}->{'CID_GUEST'};

    # キャラの表示順
    my @order = ( '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', );

    # キャラの肩書き
    my %chrjob = (
        '01'   => '天海',
        '02'   => '如月',
        '03'   => '萩原',
        '04'   => '高槻',
        '05'   => '秋月',
        '06'   => '三浦',
        '07'   => '水瀬',
        '08'   => '菊池',
        '09'   => '双海',
        '10'   => '双海',
        '11'   => '星井',
        '12'   => '音無',
        '13'   => '社長',
        '14'   => '歌田',
        '15'   => '軽口',
        '16'   => '山崎',
        $maker => '',
        $admin => '',
        $guest => '傍観者',
    );

    # キャラの名前
    my %chrname = (
        '01'   => '春香',
        '02'   => '千早',
        '03'   => '雪歩',
        '04'   => 'やよい',
        '05'   => '律子',
        '06'   => 'あずさ',
        '07'   => '伊織',
        '08'   => '真',
        '09'   => '亜美',
        '10'   => '真美',
        '11'   => '美希',
        '12'   => '小鳥',
        '13'   => '高木',
        '14'   => '音',
        '15'   => '哲也',
        '16'   => 'すぎお',
        $maker => '天のお告げ（プロデューサー）',
        $admin => 'ゆーろ（管理人）',
        $guest => &SWUser::GetHandle,
    );

    # キャラ名頭文字（人狼譜出力用）
    my %chrnameinitial = (
        '01' => '春',
        '02' => '千',
        '03' => '雪',
        '04' => 'や',
        '05' => '律',
        '06' => 'あ',
        '07' => '伊',
        '08' => '菊',
        '09' => '亜',
        '10' => '真',
        '11' => '美',
        '12' => '小',
        '13' => '社',
        '14' => 'ボ',
        '15' => 'ダ',
        '16' => 'ビ',
    );

    # ダミーキャラの発言
    my @npcsay = ( '私が765プロの社長、高木だ。', 'ティンときた！', );

    my @expression = ();

    my %charset = (
        CAPTION        => 'アイドルマスター',
        NPCID          => '13',
        CHRNAME        => \%chrname,
        CHRJOB         => \%chrjob,
        CHRNAMEINITIAL => \%chrnameinitial,
        ORDER          => \@order,
        NPCSAY         => \@npcsay,
        IMGFACEW       => 60,
        IMGFACEH       => 75,
        IMGBODYW       => 60,
        IMGBODYH       => 90,
        DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/imas",
        EXT            => '.png',
        BODY           => '_body',
        FACE           => '_face',
        GRAVE          => '',
        EXPRESSION     => \@expression,
        LAYOUT_NAME    => 'right',
    );

    return \%charset;
}

1;
