package SWResource_emoricu;

#----------------------------------------
# Emoricu
#----------------------------------------

sub GetRSChr {
    my $sow = $_[0];

    my $maker = $sow->{'cfg'}->{'CID_MAKER'};
    my $admin = $sow->{'cfg'}->{'CID_ADMIN'};
    my $guest = $sow->{'cfg'}->{'CID_GUEST'};

    # キャラの表示順
    my @order = (
        '001', '002', '003', '004', '005', '006', '007', '008', '009', '010', '011', '012', '013', '014',
        '015', '016', '017', '018', '019', '020', '021', '022', '023', '024', '025', '026', '027', '028',
        '029', '030', '031', '032', '033', '034', '035', '036', '037', '038', '039', '040',
    );

    # キャラの肩書き
    my %chrjob = (
        '001'  => '噂好き',
        '002'  => '花売り',
        '003'  => '冷静',
        '004'  => '天然発明家',
        '005'  => '大食い',
        '006'  => '騒音',
        '007'  => '秘密主義',
        '008'  => '妖艶',
        '009'  => '一匹狼',
        '010'  => '野生児',
        '011'  => 'ナルコレプシー',
        '012'  => 'エセ科学者',
        '013'  => '作家',
        '014'  => 'シックスセンス',
        '015'  => '駄菓子屋',
        '016'  => '林檎姫',
        '017'  => '鬼の娘',
        '018'  => '見習い',
        '019'  => '赤の騎士',
        '020'  => '白の騎士',
        '021'  => '忠犬',
        '022'  => '捨て猫',
        '023'  => '脱獄中',
        '024'  => '婦警',
        '025'  => '町娘',
        '026'  => '青年',
        '027'  => '巫女',
        '028'  => '狐面',
        '029'  => '本好き',
        '030'  => '甘党',
        '031'  => '書記',
        '032'  => '秘書',
        '033'  => '魔女',
        '034'  => '蛇使い',
        '035'  => '自由人',
        '036'  => '心眼',
        '037'  => '医者',
        '038'  => '世話焼き',
        '039'  => 'はみ出し者',
        '040'  => '自堕落',
        $maker => '',
        $admin => '',
        $guest => '傍観者',
    );

    # キャラの名前
    my %chrname = (
        '001'  => 'ペールメール',
        '002'  => 'ミント',
        '003'  => 'ブルー',
        '004'  => 'ストロベリー',
        '005'  => 'キャンディ',
        '006'  => 'フォルカー',
        '007'  => 'ゴールド',
        '008'  => 'ルージュ',
        '009'  => 'ストーン',
        '010'  => 'シナモン',
        '011'  => 'アリス',
        '012'  => 'シャドウ',
        '013'  => 'ワーカー',
        '014'  => 'ミステル',
        '015'  => 'ウメ',
        '016'  => 'アップル',
        '017'  => 'ミヤビ',
        '018'  => 'タマゴ',
        '019'  => 'アロイス',
        '020'  => 'ロイ',
        '021'  => 'マル',
        '022'  => 'ケイト',
        '023'  => 'ヘルムート',
        '024'  => 'ルイーゼ',
        '025'  => 'レーネ',
        '026'  => 'ヨナタン',
        '027'  => 'ステラ',
        '028'  => 'キイチ',
        '029'  => 'クヌート',
        '030'  => 'ドロシー',
        '031'  => 'ハンス',
        '032'  => 'リオ',
        '033'  => 'ナナ',
        '034'  => 'ドミニク',
        '035'  => 'デニス',
        '036'  => 'ラウラ',
        '037'  => 'レナト',
        '038'  => 'ユスティーナ',
        '039'  => 'ルッツ',
        '040'  => 'ジークベルト',
        $maker => '天のお告げ（村建て人）',
        $admin => 'ゆーろ（管理人）',
        $guest => &SWUser::GetHandle,
    );

    # # キャラ名頭文字（人狼譜出力用）
    # my %chrnameinitial = (
    #     '001' => '噂',
    #     '002' => '花',
    #     '003' => '冷',
    #     '004' => '天',
    #     '005' => '大',
    #     '006' => '騒',
    #     '007' => '秘',
    #     '008' => '妖',
    #     '009' => '一',
    #     '010' => '野',
    #     '011' => 'ナ',
    #     '012' => 'エ',
    #     '013' => '作',
    #     '014' => 'シ',
    #     '015' => '駄',
    #     '016' => '林',
    #     '017' => '鬼',
    #     '018' => '見',
    #     '019' => '赤',
    #     '020' => '白',
    #     '021' => '忠',
    #     '022' => '捨',
    #     '023' => '脱',
    #     '024' => '婦',
    #     '025' => '町',
    #     '026' => '青',
    #     '027' => '巫',
    #     '028' => '狐',
    #     '029' => '本',
    #     '030' => '甘',
    #     '031' => '書',
    #     '032' => '秘',
    #     '033' => '魔',
    #     '034' => '蛇',
    #     '035' => '自',
    #     '036' => '心',
    #     '037' => '医',
    #     '038' => '世',
    #     '039' => 'は',
    #     '040' => '自',
    # );

    # ダミーキャラの発言
    my @npcsay = ( 'なぁ知ってるか？最近この辺りにさ…<br>人狼が出たらしいぜ…？', 'おーい。お前も知ってるか？<br>…ってお前、なんか変わった奴だな？', );

    my @expression = ();

    my %charset = (
        CAPTION        => 'Emoricu',
        NPCID          => '001',
        CHRNAME        => \%chrname,
        CHRJOB         => \%chrjob,
        CHRNAMEINITIAL => \%chrnameinitial,
        ORDER          => \@order,
        NPCSAY         => \@npcsay,
        IMGBODYW       => 90,
        IMGBODYH       => 130,
        DIR            => "$sow->{'cfg'}->{'DIR_IMG'}/emoricu",
        EXT            => '.png',
        BODY           => '',
        FACE           => '',
        GRAVE          => 'b',
        WOLF           => 'r',
        TSAY           => '',
        LSAY           => '',
        EXPRESSION     => \@expression,
        LAYOUT_NAME    => 'right',
    );

    return \%charset;
}

1;
