package SWResource_wbbs;

#----------------------------------------
# サンプルキャラセット
#----------------------------------------

sub GetRSChr {
    my $sow = $_[0];

    my $maker = $sow->{'cfg'}->{'CID_MAKER'};
    my $admin = $sow->{'cfg'}->{'CID_ADMIN'};
    my $guest = $sow->{'cfg'}->{'CID_GUEST'};

    # キャラの表示順
    my @order = ( '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', );

    # キャラの肩書き
    my %chrjob = (
        '01'   => '厭世家',
        '02'   => '長老',
        '03'   => '神父',
        '04'   => '木こり',
        '05'   => '旅人',
        '06'   => '村長',
        '07'   => '青年',
        '08'   => '村娘',
        '09'   => '行商人',
        '10'   => '羊飼い',
        '11'   => 'パン屋',
        '12'   => '紐',
        '13'   => '家事手伝い',
        '14'   => '農夫',
        '15'   => '宿屋の女主人',
        $maker => '',
        $admin => '',
    );

    # キャラの名前
    my %chrname = (
        '01'   => 'ゲルト',
        '02'   => 'ヴァルター',
        '03'   => 'ジムゾン',
        '04'   => 'トーマス',
        '05'   => 'ニコラス',
        '06'   => 'ディーター',
        '07'   => 'ペーター',
        '08'   => 'リーザ',
        '09'   => 'アルビン',
        '10'   => 'カタリナ',
        '11'   => 'オットー',
        '12'   => 'ヨアヒム',
        '13'   => 'パメラ',
        '14'   => 'ヤコブ',
        '15'   => 'レジーナ',
        $maker => '天のお告げ（村建て人）',
        $admin => 'ゆーろ（管理人）',
        $guest => &SWUser::GetHandle,
    );

    # キャラ名頭文字（人狼譜出力用）
    my %chrnameinitial = (
        '01' => 'ゲ',
        '02' => 'ヴ',
        '03' => 'ジ',
        '04' => 'ト',
        '05' => 'ニ',
        '06' => 'デ',
        '07' => 'ペ',
        '08' => 'リ',
        '09' => 'ア',
        '10' => 'カ',
        '11' => 'オ',
        '12' => 'ヨ',
        '13' => 'パ',
        '14' => 'ヤ',
        '15' => 'レ',
    );

    # ダミーキャラの発言
    my @npcsay = ( '人狼いたわ', 'もう寝るのは飽きたんだ', );

    my @expression = ();

    my %charset = (
        CAPTION        => '人狼BBS10周年',
        NPCID          => '01',
        CHRNAME        => \%chrname,
        CHRJOB         => \%chrjob,
        CHRNAMEINITIAL => \%chrnameinitial,
        ORDER          => \@order,
        NPCSAY         => \@npcsay,

        #		IMGFACEW       => 80,
        #		IMGFACEH       => 100,
        IMGBODYW => 80,
        IMGBODYH => 100,

        #		IMGMOBILEW     => 16,
        #		IMGMOBILEH     => 16,
        DIR         => "$sow->{'cfg'}->{'DIR_IMG'}/wbbs",
        EXT         => '.jpg',
        BODY        => '',
        FACE        => '',
        GRAVE       => '',
        WOLF        => '',
        EXPRESSION  => \@expression,
        LAYOUT_NAME => 'right',
    );

    return \%charset;
}

1;
